/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   here_doc.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dongmlee <dongmlee@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/10 02:07:33 by dongmlee          #+#    #+#             */
/*   Updated: 2022/05/10 02:56:47 by dongmlee         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../include/minishell.h"

/*
1. 명령어 중에 "<<" 있는 지 찾기
2. 있을 경우 해당 문자열에 맞는 파일 생성하기
3. here구조체 안에 종료 조건 문자열 길이, 종료 조건 문자열, 인덱스 넣기
*/
int	here_doc_test(t_cmd *cmd)
{
	return (1);
}
